Amiya200/stm32_water_tank/Core/Src/model_handle.c
    Buzzer_SetPin(true);
}

static void Buzzer_TankFullPattern(void)
{
    uint32_t now = HAL_GetTick();

    if ((now - buzzerPatternStart) >= 15000UL)
    {
        Buzzer_SetPin(false);
        activeBuzzEvent = BUZZ_NONE;
        return;
    }

    Buzzer_SetPin(true);
}
static void Buzzer_Update(void)
{
    uint32_t now = HAL_GetTick();

    static uint32_t motorToggleTime = 0;
    static bool motorBuzzState = false;

    /* -------- Tank Events (highest priority) -------- */

    if (activeBuzzEvent == BUZZ_TANK_EMPTY)
    {
        Buzzer_TankEmptyPattern();
        return;
    }

    if (activeBuzzEvent == BUZZ_TANK_FULL)
    {
        Buzzer_TankFullPattern();
        return;
    }

    /* -------- Motor Running Pattern -------- */

    bool motorOn = Motor_GetStatus();

    if (motorOn)
    {
        if ((now - motorToggleTime) >= 1000UL)
        {
            motorToggleTime = now;
            motorBuzzState = !motorBuzzState;
        }

        Buzzer_SetPin(motorBuzzState);
        return;
    }

    /* -------- Idle -------- */

    Buzzer_SetPin(false);
}


static inline uint32_t now_ms(void)
{
    return HAL_GetTick();
}
void ModelHandle_SetProtectionSettings(uint32_t retry_gap_sec,
                                        uint16_t dry_time_sec,
                                        uint8_t  dry_enable)
{
    if (retry_gap_sec < 60)
        retry_gap_sec = 60;

    if (retry_gap_sec > 10800)
        retry_gap_sec = 10800;

    if (dry_time_sec < 60)
        dry_time_sec = 60;

    if (dry_time_sec > 900)
        dry_time_sec = 900;

    sys.gap_time_s     = retry_gap_sec;
    sys.dry_run_time_s = dry_time_sec;
    sys.dry_run_enable = dry_enable ? 1 : 0;

    ModelHandle_SaveSettingsToEEPROM();
}
static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
    countdownMode   = false;
}

void ModelHandle_OnPowerUp(void)
{
    powerOnMs = HAL_GetTick();
    autoBootIgnoreUntil = powerOnMs + 15000UL;
    bootStartBlockUntil = powerOnMs + MOTOR_START_DELAY_MS;
    autoDeadline = 0;
    if (timer_any_active_slot())
    {
        timerActive = true;
        timerState  = TIMER_RUN_TEST;
        timerStateDeadline = 0;
        motorOwner  = MOTOR_OWNER_TIMER;
    }
    if (autoActive)
    {
        uint8_t level = get_tank_level_percent();
        if (level <= AUTO_START_LEVEL_PERCENT)
        {
            motorOwner = MOTOR_OWNER_AUTO;
            autoState  = AUTO_ON_WAIT;
            uint32_t gapSec = (sys.gap_time_s == 0) ? 120 : sys.gap_time_s;
            autoDeadline = HAL_GetTick() + (gapSec * 1000UL);
        }
        else
        {
            autoActive = false;
            motorOwner = MOTOR_OWNER_NONE;
        }
    }
}

static inline bool Motor_IsRelayOn(void)
{
    return HAL_GPIO_ReadPin(Relay1_GPIO_Port, Relay1_Pin) == GPIO_PIN_SET;
}
static bool Motor_StartAllowed(void)
{
    if (senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached)
        return false;

    return true;
}

bool ModelHandle_IsRestartActive(void)
{
    return restartActive;
}

static inline void motor_apply(bool on)
{
    if (timerActive && timerState == TIMER_WAIT_RETRY)
        on = false;
    bool relayNow = Motor_IsRelayOn();
    if (on)
    {
        if (!Motor_StartAllowed())
            return;
        if (!relayNow)
        {
            Relay_Set(1, true);
            motorOnStartMs = HAL_GetTick();
        }
        motorStatus = 1;
    }
    else
    {
        if (relayNow)
            Relay_Set(1, false);
        motorStatus = 0;
    }
    UART_SendStatusPacket();
}

bool Motor_GetStatus(void)
{
    return Motor_IsRelayOn();
}
static inline void start_motor(void)
{
    uint32_t now = HAL_GetTick();
    if (HAL_GetTick() < bootStartBlockUntil)
        return;
    if (now < bootStartBlockUntil &&
        motorOwner != MOTOR_OWNER_MANUAL &&
        motorOwner != MOTOR_OWNER_SEMIAUTO &&
        motorOwner != MOTOR_OWNER_TIMER &&
        motorOwner != MOTOR_OWNER_COUNTDOWN &&
        motorOwner != MOTOR_OWNER_TWIST)
    {
        return;
    }

    if (motorOwner == MOTOR_OWNER_NONE)
        return;
    motor_apply(true);
}

static inline void stop_motor(void)
{
    motor_apply(false);
}
static void check_max_run(void)
{
    if (sys.maxrun_min == 0 || !Motor_GetStatus())
        return;
    if (countdownActive)
        return;
    if (restartActive)
        return;
    uint32_t limit = (uint32_t)sys.maxrun_min * 60000UL;

    if ((HAL_GetTick() - motorOnStartMs) >= limit)
    {
        senseMaxRunReached = true;
        clear_all_modes();
        stop_motor();
        ModelHandle_SaveModeState();
    }
}
void ModelHandle_Button4_SinglePress(void)
{
    if (!countdownActive)
    {
        clear_all_modes();

        countdownActive = true;
        countdownMode   = true;

        motorOwner = MOTOR_OWNER_COUNTDOWN;

        uint32_t defaultSeconds = 600;

        cd_deadline = HAL_GetTick() + defaultSeconds * 1000UL;

        countdownDuration = defaultSeconds;

        start_motor();
    }
    else
    {
        ModelHandle_StopCountdown();
    }

    ModelHandle_SaveModeState();
}
void ModelHandle_CheckDryRun(void)
{
    if (manualActive)
    {
        senseDryRun = false;
        return;
    }

    float v = adcData.voltages[5];

    if (v < 0.30f)
        senseDryRun = true;
    else
        senseDryRun = false;
}
#define GROUND_SENSE_DELAY_MS 10000UL

void ModelHandle_CheckGroundWater(void)
{
    static uint32_t detectStart = 0;
    static bool stableState = false;

    float v = adcData.voltages[4];

    bool detected = (v < 0.30f);

    uint32_t now = HAL_GetTick();

    if (detected)
    {
        if (!stableState)
        {
            if (detectStart == 0)
                detectStart = now;

            if ((now - detectStart) >= GROUND_SENSE_DELAY_MS)
                stableState = true;
        }
    }
    else
    {
        detectStart = 0;
        stableState = false;
    }

