Amiya200/stm32_water_tank/Core/Src/model_handle.c
    switch (timerState)
    {

        case TIMER_RUN_TEST:

            motorOwner = MOTOR_OWNER_TIMER;
            start_motor();

            if (timerStateDeadline == 0)
                timerStateDeadline = now + dryTestMs;

            if (now >= timerStateDeadline)
            {
                if (senseDryRun == false)
                {
                    stop_motor();
                    timerState = TIMER_WAIT_RETRY;
                    timerStateDeadline = now + retryGapMs;
                }
                else
                {
                    timerState = TIMER_RUN_CONTINUOUS;
                }
            }

        break;


        case TIMER_WAIT_RETRY:

            if (now >= timerStateDeadline)
            {
                timerState = TIMER_RUN_TEST;
                timerStateDeadline = 0;
            }

        break;


        case TIMER_RUN_CONTINUOUS:

            start_motor();

            if (senseDryRun == false)
            {
                stop_motor();
                timerState = TIMER_WAIT_RETRY;
                timerStateDeadline = now + retryGapMs;
            }

        break;
    }
}


void ModelHandle_StartTimer(void)
{
    ModelHandle_SaveTimerToEEPROM();
}

void ModelHandle_StopTimer(void)
{
    timerActive = false;
    timerStateDeadline = 0;
    stop_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_CheckAutoTimerActivation(void)
{
    if (timerActive) return;
    if (timer_any_active_slot())
    {
        timerActive = true;
        start_motor();
    }
}

void ModelHandle_StartSemiAuto(void)
{
    restartActive = false;
    clear_all_modes();
    semiAutoActive = true;
    motorOwner     = MOTOR_OWNER_SEMIAUTO;
    semiState      = SEMI_RUN_TEST;
    semiDeadline   = 0;
    semiWaterLossPending = false;
    senseMaxRunReached = false;
    start_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
void ModelHandle_StartAuto(uint16_t gap_s,
                           uint16_t maxrun_min,
                           uint8_t retry)
{
    clear_all_modes();
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;
    autoUserLocked   = false;
    autoActive = true;
    autoState  = AUTO_ON_WAIT;
    motorOwner = MOTOR_OWNER_AUTO;
    ModelHandle_SaveModeState();
}
void ModelHandle_StopAuto(void)
{
    stop_motor();
    autoActive = false;
    autoState  = AUTO_IDLE;
    auto_retry_count = 0;
    autoDeadline = 0;
    ModelHandle_SaveModeState();
}

void ModelHandle_LoadAutoSettings(void)
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
    if (auto_gap_s < 30 || auto_gap_s > 3600)
    {
        auto_gap_s = 120;
        EEPROM_WriteBlockSafe(0x0300,
                              (uint8_t*)&auto_gap_s,
                              sizeof(auto_gap_s));
    }
    if (auto_maxrun_min == 0xFFFF || auto_maxrun_min > 600)
    {
        auto_maxrun_min = 30;
        EEPROM_WriteBlockSafe(0x0302,
                              (uint8_t*)&auto_maxrun_min,
                              sizeof(auto_maxrun_min));
    }
    if (auto_retry_limit == 0xFF || auto_retry_limit > 20)
    {
        auto_retry_limit = 3;
        EEPROM_WriteBlockSafe(0x0304,
                              (uint8_t*)&auto_retry_limit,
                              sizeof(auto_retry_limit));
    }
}

static void auto_mode_background_control(void)
{
    if (!autoBackgroundEnabled)
        return;
    if (autoUserLocked)
        return;
    uint32_t now = HAL_GetTick();
    if (now < autoBootIgnoreUntil)
        return;
    if (now < bootBlockUntil)
        return;
    if (manualActive ||
        semiAutoActive ||
        timerActive ||
        countdownActive ||
        twistActive)
        return;
    ModelHandle_CheckGroundWater();
    uint8_t level = get_tank_level_percent();
    if (!autoActive &&
        level <= AUTO_START_LEVEL_PERCENT &&
        powerRestoreMode != 1)
    {
        ModelHandle_StartAuto(
            sys.gap_time_s,
            auto_maxrun_min,
            auto_retry_limit
        );
        return;
    }
    if (autoActive &&
        level >= AUTO_STOP_LEVEL_PERCENT)
    {
        ModelHandle_StopAuto();
    }
}


void ModelHandle_SetBuzzerSettings(uint8_t pump,
                                   uint8_t full,
                                   uint8_t empty)
{
    buzzerSettings.pumpOnSound   = pump ? 1 : 0;
    buzzerSettings.tankFullSound = full ? 1 : 0;
    buzzerSettings.tankEmptySound= empty ? 1 : 0;
    ModelHandle_SaveBuzzerSettings();
}
static void auto_tick(void)
{
    if (!autoActive)
        return;

    uint32_t now = HAL_GetTick();

    uint32_t dryTestMs  = sys.gap_time_s * 1000UL;
    uint32_t retryGapMs = sys.dry_run_time_s * 1000UL;

    ModelHandle_CheckDryRun();

    uint8_t level = get_tank_level_percent();

    bool protectionFault =
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached;

    if (protectionFault)
    {
        stop_motor();
        autoState = AUTO_IDLE;
        stateDeadline = 0;
        return;
    }

    if (level >= AUTO_STOP_LEVEL_PERCENT)
    {
        stop_motor();
        autoState = AUTO_IDLE;
        stateDeadline = 0;
        return;
    }

    switch (autoState)
    {

        case AUTO_ON_WAIT:

            if (level <= AUTO_START_LEVEL_PERCENT)
            {
                motorOwner = MOTOR_OWNER_AUTO;

                start_motor();

                if (stateDeadline == 0)
                    stateDeadline = now + dryTestMs;

                if (now >= stateDeadline)
                {
                    if (senseDryRun == true)
                    {
                        autoState = AUTO_OFF_WAIT;
                        stateDeadline = 0;
                    }
                    else
                    {
                        stop_motor();

                        autoState = AUTO_DRY_CHECK;
                        stateDeadline = now + retryGapMs;
                    }
                }
            }

        break;


        case AUTO_DRY_CHECK:

