Amiya200/stm32_water_tank/Core/Src/model_handle.c
            if (now >= stateDeadline)
            {
                autoState = AUTO_ON_WAIT;
                stateDeadline = 0;
            }

        break;


        case AUTO_OFF_WAIT:

            start_motor();

            if (senseDryRun == false)
            {
                stop_motor();

                autoState = AUTO_DRY_CHECK;
                stateDeadline = now + retryGapMs;
            }

        break;


        default:

            autoState = AUTO_IDLE;
            stateDeadline = 0;

        break;
    }
}
void ModelHandle_StartCountdown(uint32_t seconds)
{
    if (seconds < 60)
        seconds = 60;

    if (seconds > 10800)
        seconds = 10800;

    clear_all_modes();

    senseMaxRunReached = false;

    countdownActive   = true;
    countdownMode     = true;

    uint32_t now = HAL_GetTick();

    cd_deadline       = now + (seconds * 1000UL);
    countdownDuration = seconds;

    motorOwner = MOTOR_OWNER_COUNTDOWN;

    start_motor();

    ModelHandle_SaveModeState();
}

void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownMode   = false;
    cd_deadline     = 0;
    countdownDuration = 0;
    stop_motor();
    ModelHandle_SaveModeState();
}


static uint16_t CD_CRC(const uint8_t* d,uint16_t l){
    uint16_t c=0xFFFF;
    while(l--) c=(c>>1)^(*d++ + 0xA001);
    return c;
}

static void SaveCountdown(void)
{
    CountdownBlock b;
    memset(&b, 0, sizeof(b));
    b.sig = CD_SIGNATURE;
    b.active = countdownActive;
    if (countdownActive)
    {
        uint32_t now = now_ms();
        if (cd_deadline > now)
            b.remaining = (cd_deadline - now) / 1000UL;
        else
            b.remaining = 0;
    }
    else
    {
        b.remaining = 0;
    }
    b.crc = CD_CRC((uint8_t*)&b, sizeof(b)-2);
    EEPROM_WriteBuffer(EE_ADDR_COUNTDOWN_BLOCK,
                       (uint8_t*)&b,
                       sizeof(b));
}
void ModelHandle_LoadCountdown(void)
{
    CountdownBlock b;
    EEPROM_ReadBuffer(EE_ADDR_COUNTDOWN_BLOCK,
                      (uint8_t*)&b, sizeof(b));
    if (b.sig != CD_SIGNATURE)
        return;
    if (CD_CRC((uint8_t*)&b, sizeof(b)-2) != b.crc)
        return;
    if (b.active && b.remaining > 0)
    {
        countdownActive   = true;
        countdownMode     = true;
        countdownDuration = b.remaining;
        cd_deadline = now_ms() +
                      b.remaining * 1000UL;
        motorOwner = MOTOR_OWNER_COUNTDOWN;
    }
}

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();
    uint32_t on_sec  = (on_s  ? on_s  : 1) * 60UL;
    uint32_t off_sec = (off_s ? off_s : 1) * 60UL;
    twistSettings.onDurationSeconds  = on_sec;
    twistSettings.offDurationSeconds = off_sec;
    twistSettings.onHour = onH;
    twistSettings.onMinute = onM;
    twistSettings.offHour = offH;
    twistSettings.offMinute = offM;
    twistSettings.twistArmed = true;
    twistSettings.twistActive = false;
    twist_on_phase = true;
    twist_deadline = now_ms() + on_sec * 1000UL;
    start_motor();
}

void ModelHandle_StopTwist(void)
{
    twistActive = false;
    twistSettings.twistActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}

static void twist_tick(void)
{
    if (!twistActive)
        return;

    if (isTankFull())
    {
        ModelHandle_StopTwist();

        if (buzzerSettings.tankFullSound)
            Buzzer_StartEvent(BUZZ_TANK_FULL);

        return;
    }

    uint32_t now = now_ms();

    if (now >= twist_deadline)
    {
        twist_on_phase = !twist_on_phase;

        twist_deadline = now +
            (twist_on_phase ?
             twistSettings.onDurationSeconds :
             twistSettings.offDurationSeconds) * 1000UL;
    }

    if (twist_on_phase)
        start_motor();
    else
        stop_motor();
}
static void leds_from_model(void)
{
    LED_ClearAllIntents();

    bool motorOn = Motor_GetStatus();

    if (dryState == DRY_WAITING)
    {
        LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);
        LED_ApplyIntents();
        return;
    }

    if (dryState == DRY_FAULT)
    {
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 400);
        LED_ApplyIntents();
        return;
    }

    if (motorOn)
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);

    if (senseMaxRunReached)
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 300);

    if (senseOverLoad || senseUnderLoad)
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);

    if (senseOverUnderVolt)
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);

    LED_ApplyIntents();
}
void ModelHandle_Process(void)
{
    uint32_t now = HAL_GetTick();

    if (modeSwitchPending)
    {
        if (now >= modeSwitchTime)
        {
            modeSwitchPending = false;
            motorOwner = pendingOwner;
        }
        return;
    }

    ModelHandle_CheckGroundWater();
    ModelHandle_CheckDryRun();
    ModelHandle_CheckLoadFault();
    check_max_run();

    bool protectionFault =
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached;

    bool tankFull = isTankFull();

    /* ---------- Owner Resolution ---------- */

    if (restartActive)
        motorOwner = MOTOR_OWNER_RESTART;
    else if (timerActive)
        motorOwner = MOTOR_OWNER_TIMER;
    else if (manualActive)
        motorOwner = MOTOR_OWNER_MANUAL;
    else if (semiAutoActive)
        motorOwner = MOTOR_OWNER_SEMIAUTO;
    else if (countdownActive)
        motorOwner = MOTOR_OWNER_COUNTDOWN;
    else if (twistActive)
        motorOwner = MOTOR_OWNER_TWIST;
    else if (autoActive)
        motorOwner = MOTOR_OWNER_AUTO;
    else
        motorOwner = MOTOR_OWNER_NONE;

    /* ================================================================
       FIX: Tank Full Handling — one-shot buzzer guard
       Root cause of old bug: Buzzer_StartEvent() was called on every
       loop iteration once the 10 s delay passed. Each call resets
       buzzerPatternStart to now, so the 15 s pattern never completes —
       it restarts every loop, producing a continuous 15 s beep cycle.
       Fix: tankFullBuzzFired flag ensures the buzzer fires only ONCE
       per tank-full event. It clears when the tank level drops below
       full so the next genuine fill event will buzz again.
    ================================================================ */

    static bool prevTankFull      = false;
    static bool tankFullBuzzFired = false;   /* one-shot guard */

    if (tankFull && motorOwner != MOTOR_OWNER_MANUAL)
    {
        if (!prevTankFull)
        {
            /* Leading edge of tank-full: start the delay timer
               and reset the one-shot so the buzzer can fire once */
            tankFullDetectedAt  = now;
            tankFullBuzzFired   = false;
        }

        if ((now - tankFullDetectedAt) >= TANK_FULL_DELAY_MS)
        {
            stop_motor();

